Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<BasedOn>
				<xr:Item>Document.ИнвойсПродажи</xr:Item>
				<xr:Item>Document.ПриходнаяНакладная</xr:Item>
				<xr:Item>Document._ВозвратОтПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РезервыТовара</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВДороге</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКонсигнации</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>стрПроцент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлагНеПроверятьОстатки</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>счеКонсигнация</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУслуг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВозвратов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_СуммаСЗатратами</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._ВозвратОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвойсПродажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтгрузкуРазрешил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПлюс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентМинус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДляПечати</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>21</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>стрПроцент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>счКонсигнация</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУслуг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозврата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСоСкидкой</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВКД_ЦенаСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ПересчитатьСтроку(Стр, СоотвЗатратыПартии, СоотвЗатратыПартииИнв)
	
	//2017.01.17
	Если ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда 
		Стр.СуммаПродажи = 0;
	Иначе 
		Стр.СуммаПродажи = Стр.ЦенаПродажи * Стр.Количество;
	КонецЕсли;
	
	//2016.05.24
	Если ЗначениеЗаполнено(Стр.Партия) Тогда 
		Стр.Серия = Стр.Партия.Серия;
		
		//****************************  
		//Стр.ВКД_ЦенаСоСкидкой = омСервер.ПересчетЗн(?(Стр.Партия.ВКД_ЦенаСоСкидкой = 0, Стр.Партия.ЦенаЗакупки, Стр.Партия.ВКД_ЦенаСоСкидкой), 
		//											Стр.Партия.Валюта, 
		//											Валюта, 
		//											Фирма, 
		//											Дата, 
		//											Фирма.ЧислоЗнаковЦенаЗакупки);
		////Стр.ВКД_ЦенаСЗатратами = омСервер.ПересчетЗн(?(Стр.Партия.ВКД_ЦенаСЗатратами = 0, 
		////													?(Стр.Партия.ВКД_ЦенаСоСкидкой = 0, Стр.Партия.ЦенаЗакупки, Стр.Партия.ВКД_ЦенаСоСкидкой),
		////													Стр.Партия.ВКД_ЦенаСЗатратами), 
		////											Стр.Партия.Валюта, Валюта, Фирма, Дата, Фирма.ЧислоЗнаковЦенаЗакупки);
		// © Primus1C  28.04.2026  НАЧАЛО ► 
		Стр.ЦенаЗакупки = РаботаСВалютой.Пересчитать2025(Стр.Партия.ЦенаЗакупки,
                                                    			Стр.Партия.Валюта,
																Валюта, 
																Фирма, 
																Дата);
        Если Стр.Партия.ВКД_ЦенаСоСкидкой = 0 Тогда
			Стр.ВКД_ЦенаСоСкидкой = Стр.ЦенаЗакупки;
		Иначе
			Стр.ВКД_ЦенаСоСкидкой = РаботаСВалютой.Пересчитать2025(Стр.Партия.ВКД_ЦенаСоСкидкой,
                                                    			Стр.Партия.Валюта,
																Валюта, 
																Фирма, 
																Дата);
		КонецЕсли;
		// © Primus1C  ОКОНЧАНИЕ ◄
		//****************************
		
		// © Primus1C  02.12.2025  НАЧАЛО ►
		
			//// © Primus1C  05.05.2025  НАЧАЛО ►
			//Цены = ОбщегоНазначенияСервер.СоставЗатрат(Стр.Партия, Ссылка, Истина);
			//Стр.ВКД_ЦенаСЗатратами = Цены.СуммаВал + Стр.ЦенаЗакупки;  
			//Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.ВКД_ЦенаСЗатратами * Стр.Количество);
			//// © Primus1C  ОКОНЧАНИЕ ◄
		
		ЦенаЗатратПартии = СоотвЗатратыПартии.Получить(Стр.Партия);  
		Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартии) Тогда
		 	ЦенаЗатратПартии = 0;
		КонецЕсли; 
		ЦенаЗатратПартииИнв = СоотвЗатратыПартииИнв.Получить(Стр.Партия);  
		Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартииИнв) Тогда
		 	ЦенаЗатратПартииИнв = 0;
		КонецЕсли; 
		ЦенаЗатрат = омСервер.ПересчетЗн(ЦенаЗатратПартии + ЦенаЗатратПартииИнв, ПараметрыСеанса.БазоваяВалюта, Валюта, Фирма, Дата, Фирма.ЧислоЗнаковЦенаЗакупки); 
		Стр.ВКД_ЦенаСЗатратами = ЦенаЗатрат + Стр.ЦенаЗакупки;  
		////////+
		//Стр.ВКД_ЦенаСЗатратами = РаботаСВалютой.Пересчитать2025(Стр.ЦенаЗакупки + ЦенаЗатратПартии + ЦенаЗатратПартииИнв, ПараметрыСеанса.БазоваяВалюта, Валюта, Фирма, Дата);
		////////-
		Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.ВКД_ЦенаСЗатратами * Стр.Количество);
		
		// © Primus1C  ОКОНЧАНИЕ ◄
		
		//2016.01.31
		СтрПартияЦенаЗакупки = Стр.Партия.ЦенаЗакупки;
		Если (СтрПартияЦенаЗакупки = 0) И (Стр.Партия.Консигнация) Тогда
			Стр.ЦенаЗакупки = Стр.ЦенаПродажи;
		//Иначе 
		//	Стр.ЦенаЗакупки = омСервер.ПересчетЗн(СтрПартияЦенаЗакупки, Стр.Партия.Валюта, Валюта, Фирма, Дата, Фирма.ЧислоЗнаковЦенаЗакупки);
		КонецЕсли; 
		
		//2017.01.17
		Если ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда 
			Стр.СуммаЗакупки = 0;
		Иначе 
			Стр.СуммаЗакупки = Стр.ЦенаЗакупки * Стр.Количество;
		КонецЕсли;
		
		////ВКД++
		////Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.СуммаЗакупки);
		//Если Стр.ВКД_ЦенаСЗатратами = 0 Тогда
		//	Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.СуммаЗакупки);
		//Иначе
		//	//Вставка ВИКОД
		//	//Автор: Белеля Т, 07.04.2023, Задача:000017307
		//	//Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.ВКД_ЦенаСЗатратами); 
		//	Стр.стрПроцент = гоПроцент0(Стр.СуммаПродажи, Стр.ВКД_ЦенаСЗатратами*Стр.Количество);
		//    //окончание вставки
		//КонецЕсли;
		////ВКД--
		
		//2016.01.31
		Стр.счКонсигнация = ?(Стр.Партия.Консигнация, 1, 0);
		//2016.05.24
		Стр.СуммаУслуг = 0;
		
	Иначе 
		
		//2016.05.24
		Стр.Серия = "";
		Стр.ЦенаЗакупки = 0;
		Стр.стрПроцент = "У";
		Стр.счКонсигнация = 0;
		Стр.СуммаУслуг = Стр.СуммаПродажи;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПересчитатьИтоги()

	Сумма = Товары.Итог("СуммаПродажи");

	СуммаЗакупки = Товары.Итог("СуммаЗакупки");
	
	//ВКД++
	ВКД_СуммаСоСкидкой = Товары.Итог("ВКД_ЦенаСоСкидкой");

	//Вставка ВИКОД
	//Автор: Белеля Т, 07.04.2023, Задача:000017307
	//ВКД_СуммаСЗатратами = Товары.Итог("ВКД_ЦенаСЗатратами");   
	лВКД_СуммаСЗатратами = 0;
	Для каждого стр из Товары цикл
		лВКД_СуммаСЗатратами = лВКД_СуммаСЗатратами + стр.ВКД_ЦенаСЗатратами * стр.Количество;   
	КонецЦикла;
	//окончание вставки
	ВКД_СуммаСЗатратами = лВКД_СуммаСЗатратами;
	
	//ВКД--
	
	//2016.05.24
	СуммаУслуг = Товары.Итог("СуммаУслуг");
	
	//ВКД++
	//стрПроцент = гоПроцент0(Сумма - СуммаУслуг, СуммаЗакупки);
	Если ВКД_СуммаСЗатратами = 0 Тогда
	  стрПроцент = гоПроцент0(Сумма - СуммаУслуг, СуммаЗакупки);
    Иначе 
	  стрПроцент = гоПроцент0(Сумма - СуммаУслуг, ВКД_СуммаСЗатратами);
    КонецЕсли;
	//ВКД--
	
	Строк = Товары.Количество();
	СуммаПривязано = Привязки.Итог("Сумма1");
	//2016.01.31
	счеКонсигнация = Товары.Итог("счКонсигнация");  
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)    
	
	// © Primus1C  02.04.2025  НАЧАЛО ►
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;      
	
	// Затраты  (в долларах)
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", Ссылка);
	//Запр.Текст = "ВЫБРАТЬ
	//			|	Затраты.Партия КАК Партия,
	//			|	СУММА(Затраты.Сумма) КАК Сумма
	//			|ИЗ
	//			|	РегистрСведений.Затраты КАК Затраты
	//			|ГДЕ
	//			|	Затраты.Партия В
	//			|			(ВЫБРАТЬ
	//			|				РНТовары.Партия
	//			|			ИЗ
	//			|				Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|			ГДЕ
	//			|				РНТовары.Ссылка = &Ссылка)
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	Затраты.Партия
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ
	//			|	Свод.Партия КАК Партия,
	//			//|	Свод.Валюта КАК Валюта,
	//			|	СУММА(Свод.Сумма) КАК Сумма
	//			|ИЗ
	//			|	(ВЫБРАТЬ
	//			|		Партии.Ссылка КАК Партия,
	//			|		Партии.Владелец КАК Номенклатура,
	//			|		Партии.Док.ВКД_Инвойс КАК Инвойс,
	//			|		Партии.Док.Поставка КАК Поставка,
	//			//|		ЗатратыИнв.Валюта КАК Валюта,
	//			|		ЗатратыИнв.Сумма КАК Сумма
	//			|	ИЗ
	//			|		Справочник.Партии КАК Партии
	//			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			|				Затраты.Сумма КАК Сумма,
	//			//|				Затраты.Валюта КАК Валюта,
	//			|				Затраты.Номенклатура КАК Номенклатура,
	//			|				Затраты.Инвойс КАК Инвойс,
	//			|				Затраты.Поставка КАК Поставка
	//			|			ИЗ
	//			|				РегистрСведений.Затраты КАК Затраты
	//			|			ГДЕ
	//			|				(Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка, Затраты.Партия) В
	//			|						(ВЫБРАТЬ
	//			|							П.Владелец,
	//			|							П.Док.ВКД_Инвойс,
	//			|							П.Док.Поставка,
	//			|							ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	//			|						ИЗ
	//			|							Справочник.Партии КАК П
	//			|						ГДЕ
	//			|							П.Ссылка В
	//			|								(ВЫБРАТЬ
	//			|									РНТовары.Партия
	//			|								ИЗ
	//			|									Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|								ГДЕ
	//			|									РНТовары.Ссылка = &Ссылка))) КАК ЗатратыИнв
	//			|			ПО Партии.Владелец = ЗатратыИнв.Номенклатура
	//			|				И Партии.Док.ВКД_Инвойс = ЗатратыИнв.Инвойс
	//			|				И Партии.Док.Поставка = ЗатратыИнв.Поставка
	//			|	ГДЕ
	//			|		Партии.Ссылка В
	//			|				(ВЫБРАТЬ
	//			|					РНТовары.Партия
	//			|				ИЗ
	//			|					Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|				ГДЕ
	//			|					РНТовары.Ссылка = &Ссылка)) КАК Свод
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	Свод.Партия
	//			//|	Свод.Валюта
	//			|";
	//Пакет = Запр.ВыполнитьПакет();
	//ВыборкаПартии = Пакет[0].Выбрать(); 
	//СоотвЗатратыПартии = Новый Соответствие;
	//Пока ВыборкаПартии.Следующий() Цикл
	//	СоотвЗатратыПартии.Вставить(ВыборкаПартии.Партия, ВыборкаПартии.Сумма);		
	//КонецЦикла;
	//ВыборкаПартииИнв = Пакет[1].Выбрать(); 
	//СоотвПартииИнв = Новый Соответствие;
	//Пока ВыборкаПартииИнв.Следующий() Цикл
	//	СоотвПартииИнв.Вставить(ВыборкаПартииИнв.Партия, ВыборкаПартииИнв.Сумма);		
	//КонецЦикла;
	
	ЗатратыПартий = Документы.РасходнаяНакладная.ЗатратыПартий(Товары.ВыгрузитьКолонку("Партия"));
	//ЗатратыПартий = ПроведениеДокументов.ЗатратыПартий(Товары.ВыгрузитьКолонку("Партия"));
	
	//2017.01.18
	КоличествоВозвратов = 0;
	Для Каждого Стр Из Товары Цикл 
		//+++
		Стр.ДатаВозврата = Дата(1,1,1);
		//---
		ПересчитатьСтроку(Стр, ЗатратыПартий.ЗатратыПартии, ЗатратыПартий.ЗатратыПартииИнвойсов);
		//2017.01.18
		Если ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда гоПлюс(КоличествоВозвратов, Стр.Количество) КонецЕсли; 
	КонецЦикла; 

	
	// ПроцентПлюс и ПроцентМинус 
	ПроцентПлюс = 0;
	ПроцентМинус = 0;
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("ТЧ", Товары.Выгрузить()); 
	Запр.УстановитьПараметр("ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар);
	Запр.Текст = "ВЫБРАТЬ
	             |	ТЧ.Номенклатура КАК НоменклатураТЧ,
	             |	ТЧ.СуммаЗакупки КАК СуммаЗакупки,
	             |	ТЧ.СуммаПродажи КАК СуммаПродажи,
	             |	ТЧ.СуммаУслуг КАК СуммаУслуг,
	             |	ТЧ.ВКД_ЦенаСЗатратами КАК ВКД_ЦенаСЗатратами,
	             |	ТЧ.Количество КАК Количество
	             |ПОМЕСТИТЬ ТЧ
	             |ИЗ
	             |	&ТЧ КАК ТЧ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Товары.НоменклатураТЧ КАК НоменклатураТЧ,
	             |	Товары.СуммаЗакупки КАК СуммаЗакупки,
	             |	Товары.СуммаПродажи КАК СуммаПродажи,
	             |	Товары.СуммаУслуг КАК СуммаУслуг,
	             |	Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг КАК СуммаСЗатратами,
	             |	ВЫБОР
	             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг < Товары.СуммаПродажи
	             |			ТОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК СуммаСЗатратамиПлюс,
	             |	ВЫБОР
	             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг > Товары.СуммаПродажи
	             |			ТОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК СуммаСЗатратамиМинус,
	             |	ВЫБОР
	             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг < Товары.СуммаПродажи
	             |			ТОГДА Товары.СуммаПродажи
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК СуммаПродажиПлюс,
	             |	ВЫБОР
	             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг > Товары.СуммаПродажи
	             |			ТОГДА Товары.СуммаПродажи
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК СуммаПродажиМинус
	             |ПОМЕСТИТЬ ВТ
	             |ИЗ
	             |	ТЧ КАК Товары
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	             |		ПО Товары.НоменклатураТЧ = Номенклатура.Ссылка
	             |ГДЕ
	             |	Номенклатура.ТипНоменклатуры = &ТипНоменклатуры
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СУММА(ВТ.СуммаПродажи) КАК СуммаПродажи,
	             |	ЕСТЬNULL(СУММА(ВТ.СуммаСЗатратамиПлюс), 0) КАК СуммаСЗатратамиПлюс,
	             |	ЕСТЬNULL(СУММА(ВТ.СуммаСЗатратамиМинус), 0) КАК СуммаСЗатратамиМинус,
	             |	ЕСТЬNULL(СУММА(ВТ.СуммаПродажиПлюс), 0) КАК СуммаПродажиПлюс,
	             |	ЕСТЬNULL(СУММА(ВТ.СуммаПродажиМинус), 0) КАК СуммаПродажиМинус
	             |ИЗ
	             |	ВТ КАК ВТ";
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда                 
		Если Выборка.СуммаСЗатратамиПлюс <> 0 Тогда
			ПроцентПлюс = (Выборка.СуммаПродажиПлюс - Выборка.СуммаСЗатратамиПлюс) / Выборка.СуммаСЗатратамиПлюс * 100;	
		КонецЕсли;
		Если Выборка.СуммаСЗатратамиМинус <> 0 Тогда  
			ПроцентМинус = (Выборка.СуммаПродажиМинус - Выборка.СуммаСЗатратамиМинус) / Выборка.СуммаСЗатратамиМинус * 100;	
		КонецЕсли;
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	//Если глЗапретЗаписиПоДате(Ссылка) Тогда Отказ = Истина; Возврат; КонецЕсли;

	омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
	
	//БылФлагНеПроверятьОстатки = ФлагНеПроверятьОстатки;
	//Если (БылФлагНеПроверятьОстатки = 1) ИЛИ (БылФлагНеПроверятьОстатки = 9) Тогда 
	//	ФлагНеПроверятьОстатки = 2;
	//	Если БылФлагНеПроверятьОстатки = 9 Тогда Возврат КонецЕсли; 
	//ИначеЕсли БылФлагНеПроверятьОстатки = 2 Тогда 
	//	ФлагНеПроверятьОстатки = 0;
	//КонецЕсли;
	
	ПересчитатьИтоги();
	
	//2015.11.27
	//изначально суммы КР у нас нет
	СуммаКР = 0;
	//а тут пробуем посчитать и по логике, все должно быть не так, как в ДД
	Для Каждого Стр Из Привязки Цикл
		правильнаяСумма = омСервер.ПересчетЗн(Стр.Сумма2, Стр.Валюта2, Валюта, Фирма, Дата, 2);
		Если правильнаяСумма <> Стр.Сумма1 Тогда гоПлюс(СуммаКР, правильнаяСумма - Стр.Сумма1) КонецЕсли; 
	КонецЦикла;
	
	// © Primus1C  03.03.2024  НАЧАЛО ►  
	Количество = Товары.Итог("Количество");	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Префикс = глПрефиксДефис(Фирма);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Фирма = гоФирма();
	КемСоздан = гоПользователь(); 
	Создан = ТекущаяДата(); 
	Окончательно = Ложь;
	Привязки.Очистить();
	СуммаПривязано = 0;
	
	Валюта = Фирма.Валюта;
	Склад = Фирма.Склад;
	
	//2017.03.24
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхСкладов();
	Если Мас.Количество() <> 0 Тогда Склад = Мас[0] КонецЕсли; 
	
	// © Primus1C  10.12.2023  НАЧАЛО ►
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИнвойсПродажи") Тогда
		Если ДанныеЗаполнения.Проформа = Перечисления.ВидыИнвойса.Инвойс Тогда
			Сообщить(НСтр("ru = 'Расходную накладную можно вводить только на основании Проформы или Заказа!'; en = 'The invoice can only be entered based on the Proforma or Order!'"));
			Возврат;
		КонецЕсли;
		ДокументОснование	= ДанныеЗаполнения.Ссылка; 
		Склад			    = ДанныеЗаполнения.Склад;
		Контрагент 			= ДанныеЗаполнения.Контрагент;
		Валюта 				= ДанныеЗаполнения.Валюта;
		СуммаУслуг 			= ДанныеЗаполнения.Доставка;
		//Товары.Загрузить(ДанныеЗаполнения.Товары.Выгрузить());	
		Для каждого СтрокаИсточник Из ДанныеЗаполнения.Товары Цикл
			Для Инд = 1 По СтрокаИсточник.Количество Цикл
				НовСтрока = Товары.Добавить();  
				НовСтрока.Номенклатура 	= СтрокаИсточник.Номенклатура;
				НовСтрока.Количество 	= 1;
			    НовСтрока.ЦенаПродажи 	= СтрокаИсточник.Цена;  
				НовСтрока.СуммаПродажи	= НовСтрока.Количество * НовСтрока.ЦенаПродажи;
			КонецЦикла;  
		КонецЦикла;
		Количество = Товары.Итог("Количество");
        ПересчитатьИтоги();

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			
		Фирма 				= ДанныеЗаполнения.Фирма;
		ДокументОснование 	= ДанныеЗаполнения.Ссылка; 
		Склад				= ДанныеЗаполнения.Склад;
	    Валюта              = ДанныеЗаполнения.Валюта;

		Товары.Загрузить(ОбщегоНазначенияСервер.ОстаткиПриходнойНакладной(ДокументОснование));

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ВозвратОтПокупателя") Тогда

		Фирма 				= ДанныеЗаполнения.Фирма;
		ДокументОснование 	= ДанныеЗаполнения.Ссылка; 
		Склад				= ДанныеЗаполнения.Склад;
		Для каждого СтрокаТЧ Из ДанныеЗаполнения.Товары Цикл
			НовСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТЧ, "Номенклатура,Серия,Партия,Количество,ЦенаПродажи,СуммаПродажи"); 
			НовСтрока.ЦенаЗакупки 		= НовСтрока.Партия.ЦенаЗакупки;
			НовСтрока.СуммаЗакупки 		= НовСтрока.ЦенаЗакупки * НовСтрока.Количество;
			НовСтрока.ВКД_ЦенаСоСкидкой = НовСтрока.ЦенаПродажи; 
			НовСтрока.СуммаПродажи 		= НовСтрока.ЦенаПродажи * НовСтрока.Количество;
			//ВКД_ЦенаСЗатратами  
			//НовСтрока.стрПроцент = гоПроцент0(НовСтрока.СуммаПродажи, НовСтрока.ВКД_ЦенаСЗатратами * НовСтрока.Количество);   
		    //НовСтрока.ДатаВозврата = ТекущаяДата(); 
			лКонтрагент = СтрокаТЧ.Контрагент;
			лВалюта = СтрокаТЧ.Валюта;
		КонецЦикла;
		Контрагент 			= лКонтрагент;  
		Валюта 				= лВалюта;  
		Количество 			= Товары.Итог("Количество");
		КоличествоВозвратов = Количество;
		ПересчитатьИтоги();
		//Сумма 				= Товары.Итог("СуммаПродажи");
		//СуммаЗакупки        =
		//ВКД_СуммаСоСкидкой  =
		//ВКД_СуммаСЗатратами = 
		
	КонецЕсли;	
	// © Primus1C  ОКОНЧАНИЕ ◄

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ВалютаРубль = гоПараметрСеанса("Валюта");
	ВалютаДоллар = гоПараметрСеанса("БазоваяВалюта");
	
	// © Primus1C  30.11.2025  НАЧАЛО ► 
	
	Ошибки = Новый СписокЗначений;   
	
	// проверка заполнения серий
	
	запр = Новый Запрос;
	запр.УстановитьПараметр("Ссылка", Ссылка);
	запр.Текст = "ВЫБРАТЬ
	             |	РасходнаяНакладнаяТовары.НомерСтроки КАК НомерСтроки
	             |ИЗ
	             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	             |ГДЕ
	             |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	             |	И РасходнаяНакладнаяТовары.Номенклатура.УчетПоСериям
	             |	И РасходнаяНакладнаяТовары.Серия = """"";
	   Выборка = запр.Выполнить().Выбрать(); 
	   ТекстОшибки = "";
	   Пока Выборка.Следующий() Цикл
		   ТекстОшибки = ТекстОшибки + Выборка.НомерСтроки + ", ";
		КонецЦикла;
        Если ТекстОшибки <> "" Тогда
			Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Не заполнена серия: строка %1.'; en = 'Empty series: line(s) %1.'"), Лев(ТекстОшибки, СтрДлина(ТекстОшибки)-2)));
		КонецЕсли;
	
	//Если НЕ Контрагент.РазрешитьДублиСерий Тогда
	//	Запр = Новый Запрос;
	//	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	             |	КОЛИЧЕСТВО(РасходнаяНакладнаяТовары.Серия) КАК Серия
	//	             |ИЗ
	//	             |	Документ.РасходнаяНакладная.Товары КАК РасходнаяНакладнаяТовары
	//	             |ГДЕ
	//	             |	РасходнаяНакладнаяТовары.Ссылка = &Ссылка
	//	             |	И РасходнаяНакладнаяТовары.Серия <> &ПустаяСерия
	//	             |
	//	             |ИМЕЮЩИЕ
	//	             |	КОЛИЧЕСТВО(РасходнаяНакладнаяТовары.Серия) > 1";
	//	Запр.УстановитьПараметр("Ссылка", Ссылка);
	//	Запр.УстановитьПараметр("ПустаяСерия", "");
	//	Выборка = Запр.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Ошибки.Добавить(НСтр("ru = 'Дубли серии: '; en = 'Recurring series '") + Выборка.Серия);
	//	КонецЦикла;
	//КонецЕсли;
	// © Primus1C  ОКОНЧАНИЕ ◄
	
	
	//Если (ФлагНеПроверятьОстатки <> 2) И (Товары.Количество() > 0) Тогда
	Если Товары.Количество() > 0 Тогда
		
		// остатки партий
		
		//НадоЗаписать = Ложь;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МИНИМУМ(ДокТовары.НомерСтроки) КАК НомерСтроки,
		               |	ДокТовары.Номенклатура КАК Номенклатура,
		               |	ДокТовары.Партия КАК Партия,
		               |	СУММА(ВЫБОР
		               |			КОГДА ДокТовары.ДатаВозврата = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |				ТОГДА ДокТовары.Количество
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Количество
		               |ПОМЕСТИТЬ ВТТовары
		               |ИЗ
		               |	Документ.РасходнаяНакладная.Товары КАК ДокТовары
		               |ГДЕ
		               |	ДокТовары.Ссылка = &Ссылка
		               |	И ДокТовары.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
		               |	И ДокТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДокТовары.Номенклатура,
		               |	ДокТовары.Партия
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	Номенклатура,
		               |	Партия
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТТовары.НомерСтроки КАК НомерСтроки,
		               |	ВТТовары.Номенклатура КАК Номенклатура,
		               |	ВТТовары.Партия КАК Партия,
		               |	ВТТовары.Количество КАК Количество,
		               |	ЕСТЬNULL(ОстПар.ОстатокОстаток, 0) КАК Остаток
		               |ИЗ
		               |	ВТТовары КАК ВТТовары
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
		               |				&Дата,
		               |				Партия В
		               |						(ВЫБРАТЬ
		               |							Т.Партия
		               |						ИЗ
		               |							ВТТовары КАК Т)
		               |					И Склад = &Склад
		               |					И Фирма = &Фирма) КАК ОстПар
		               |		ПО ВТТовары.Партия = ОстПар.Партия
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки";

		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Дата", 	МоментВремени());
		Запрос.УстановитьПараметр("Склад", 	Склад);
		Запрос.УстановитьПараметр("Фирма", 	Фирма);
		
	// © Primus1C  17.03.2026  НАЧАЛО ►
	// Замененена логика: 
	// было: товары с нулевым остатком обнулялись
	// стало: сообщение о товарах с нулевым остатком, запрет проведения
	
	//	Исправлений = 0;
	//	Первое = Истина;
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		Если НЕ ЗначениеЗаполнено(Выборка.Партия) Тогда Продолжить КонецЕсли; 
	//		
	//		Если Выборка.Количество <= Выборка.Остаток Тогда Продолжить КонецЕсли; 
	//		Если Первое Тогда Сообщить(стрШаблон(НСтр("ru = 'Проведение %1 - не хватило остатков партий:'; en = 'Posting %1 - There were not enough remaining batches:'"),Ссылка)); Первое = Ложь; КонецЕсли; 
	//		
	//		//Сообщить(гоИмя(Выборка.Партия) + ": количество = " + Выборка.Количество + " больше остатка = " + Выборка.Остаток + "! ИСПРАВЛЕНО!!!");
	//		Сообщить(СтрШаблон(НСтр("ru = '%1: количество = %2 больше остатка = %3!'; en = '%1: quantity = %2 more than balance = %3!'"), гоИмя(Выборка.Партия), Выборка.Количество, Выборка.Остаток));
	//		
	//		БылоКолво = Выборка.Количество;		 	
	//		Колич = Выборка.Остаток;
	//		//Номен = Выборка.Партия.Владелец; 
	//		Номен = Выборка.Номенклатура;
	//		гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Ссылка, Ложь), "Расходная накладная", "Не хватило при проведении", Номен, 2);
	//		гоЗаписьЖурналаРегистрации(Строка(БылоКолво) + "->" + Строка(Колич) + "|" + гоИмя(Номен, Ложь), "Расходная накладная", "Не хватило при проведении", Ссылка, 2);
	//		
	//		локОстаток = Выборка.Остаток;
	//		Если локОстаток < 0 Тогда локОстаток = 0 КонецЕсли;
	//		Отнять = Выборка.Количество - локОстаток;
	//		
	//		Нашли = Товары.НайтиСтроки(Новый Структура("Партия", Выборка.Партия));
	//		Если Нашли.Количество() = 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Вообще не нашли " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
	//		
	//		Для Каждого Лтр Из Нашли Цикл
	//			Если Лтр.Количество >= Отнять Тогда
	//				Лтр.Количество = Лтр.Количество - Отнять;
	//				Отнять = 0;
	//			Иначе
	//				Отнять = Отнять - Лтр.Количество;
	//				Лтр.Количество = 0;
	//			КонецЕсли; 
	//			Исправлений = Исправлений + 1;
	//			Если Отнять = 0 Тогда Прервать КонецЕсли; 
	//		КонецЦикла; 
	//		
	//		Если Отнять <> 0 Тогда Отказ = Истина; Сообщить("Странная ошибка! Не смогли уменьшить количество на " + Отнять + " для " + гоИмя(Выборка.Партия)); Возврат; КонецЕсли; 
	//	КонецЦикла;
	//	
	//	НадоЗаписать = НЕ (Исправлений = 0);
	//	Если НадоЗаписать Тогда Записать(РежимЗаписиДокумента.Запись) КонецЕсли; 
	
	    Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Количество > Выборка.Остаток Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru = 'не хватает остатка товара - строка %1 (остаток %2, требуется %3)'; en = 'There is a shortage of good - line %1 (remaining %2, %3 required)'"),
								Выборка.НомерСтроки,
								Выборка.Остаток,
								Выборка.Количество));
			КонецЕсли;	
		КонецЦикла;
	
	КонецЕсли;   
	
	Если Ошибки.Количество() > 0 Тогда
		Отказ = Истина;
		Для каждого Ошибка Из Ошибки Цикл
			Сообщить(Ошибка);
		КонецЦикла;
	КонецЕсли;  
	
	Если Отказ Тогда
	    Возврат;
	КонецЕсли;  
	
	// © Primus1C  ОКОНЧАНИЕ ◄	

    // РС СтатусыИнвойсовПродаж = начало
	Если Окончательно Тогда
		УстановитьСтатус(Перечисления.СтатусыИнвойсаПродажи.Отгружен);
	Иначе
		УстановитьСтатус(Перечисления.СтатусыИнвойсаПродажи.Собирается);
	КонецЕсли;
	// РС СтатусыИнвойсовПродаж = окончание
	
    ЕстьОстатки 		= Ложь;
	ЕстьДолги 			= Ложь;
	ЕстьНезакрытые 		= Ложь;
	ЕстьРасходыДоходы 	= Ложь;
	//2015.12.08
    //ЕстьРезервы = Ложь;
	//2015.12.11
	ЕстьПродажи = Ложь;
	
	ЗапросТовары = Новый Запрос;  
	ЗапросТовары.УстановитьПараметр("Ссылка", Ссылка);
	ЗапросТовары.Текст = "ВЫБРАТЬ
	                     |	ТЧТовары.Ссылка.Дата КАК Период,
	                     |	ТЧТовары.Ссылка.Склад КАК Склад,
	                     |	ТЧТовары.Ссылка.Фирма КАК Фирма,
	                     |	ТЧТовары.Номенклатура КАК Номенклатура,
	                     |	ТЧТовары.Серия КАК Серия,
	                     |	ТЧТовары.Партия КАК Партия,
	                     |	ТЧТовары.Партия.ЦенаЗакупкиВБазВалюте КАК ЦенаЗакупкиВБазВалюте,
	                     |	ТЧТовары.Партия.Док КАК ДокументПартии,
	                     |	ТЧТовары.Партия.Контрагент КАК Поставщик,
	                     |	ТЧТовары.ДатаВозврата КАК ДатаВозврата,
	                     |	ТЧТовары.Количество КАК Количество,
	                     |	ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар) КАК ЭтоТовар,
	                     |	ТЧТовары.ВКД_ЦенаСЗатратами КАК ВКД_ЦенаСЗатратами,
	                     |	ТЧТовары.СуммаПродажи КАК СуммаПродажи,
	                     |	ТЧТовары.СуммаЗакупки КАК СуммаЗакупки
	                     |ИЗ
	                     |	Документ.РасходнаяНакладная.Товары КАК ТЧТовары
	                     |ГДЕ
	                     |	ТЧТовары.Ссылка = &Ссылка
	                     |	И ТЧТовары.Количество <> 0"; 
	Стр = ЗапросТовары.Выполнить().Выбрать();
	
	//Для Каждого Стр Из Товары Цикл  
	Пока Стр.Следующий() Цикл
		
		//Если Стр.Количество = 0 Тогда Продолжить КонецЕсли; 
		//2016.05.24
		//услуги не проводим по остаткам
		Если НЕ ЗначениеЗаполнено(Стр.Партия) Тогда Продолжить КонецЕсли;
		
		Если Стр.ЭтоТовар Тогда
			Движение = Движения.ОстаткиТовара.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Склад = Склад;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = Стр.Количество;
			Движение.Резерв = 0;
			ЕстьОстатки = Истина;
		КонецЕсли;
		
		//2017.01.18
		Если ЗначениеЗаполнено(Стр.ДатаВозврата) И Стр.ЭтоТовар Тогда
			//тут же возвращаем все, например, с минусом
			Движение = Движения.ОстаткиТовара.ДобавитьРасход();
			Движение.Период = Стр.ДатаВозврата;
			Движение.Фирма = Фирма;
			Движение.Склад = Склад;
			Движение.Номенклатура = Стр.Номенклатура;
			Движение.Партия = Стр.Партия;
			Движение.Остаток = - Стр.Количество;
			Движение.Резерв = 0;
			ЕстьОстатки = Истина;
		Иначе
			//все остальное: резервы и специальный регистр продаж - только если нет возврата
			Если НЕ Окончательно И Стр.ЭтоТовар Тогда
				Движение = Движения.ОстаткиТовара.ДобавитьПриход();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Склад = Склад;
				Движение.Номенклатура = Стр.Номенклатура;
				Движение.Партия = Стр.Партия;
				Движение.Остаток = 0;
				Движение.Резерв = Стр.Количество;
				ЕстьОстатки = Истина;
				
				////2015.12.08
				//Движение = Движения.РезервыТовара.ДобавитьПриход();
				//Движение.Период = Дата;
				//Движение.Фирма = Фирма;
				//Движение.Склад = Склад;
				//Движение.Номенклатура = Стр.Номенклатура;
				//Движение.Партия = Стр.Партия;
				//Движение.Док = Ссылка;
				//Движение.Остаток = Стр.Количество;
				//ЕстьРезервы = Истина;
			Иначе
				//2015.12.11
				Движение = Движения.Продажи.Добавить();
				Движение.Период = Дата;
				Движение.Фирма = Фирма;
				Движение.Валюта = Валюта;
				Движение.Покупатель = Контрагент;
				Движение.Номенклатура = Стр.Номенклатура;
				Движение.Количество = Стр.Количество;
				Движение.Сумма = Стр.СуммаПродажи; 
				Движение.Склад = Склад;
				//ВКД Кононов А.М. 05.02.20
				//Движение.Наценка = Стр.СуммаПродажи - Стр.СуммаЗакупки;
				Движение.Наценка = Стр.СуммаПродажи - (Стр.ВКД_ЦенаСЗатратами * Стр.Количество);
				//..     
				// © Primus1C  09.03.2025  НАЧАЛО ► 
				Движение.Партия = Стр.Партия;
				////Если Валюта <> ВалютаРубль Тогда
				////	Движение.НаценкаВалютная = Стр.СуммаПродажи - Стр.СуммаЗакупки;
				////КонецЕсли;      
				СуммаВБазВалюте = РаботаСВалютой.Пересчитать2025(Стр.СуммаПродажи, Валюта, ВалютаДоллар, Фирма, Дата);
				Движение.СуммаВБазВалюте = СуммаВБазВалюте;
				//Движение.НаценкаВБазВалюте = СуммаВБазВалюте - Стр.Количество * Стр.ЦенаЗакупкиВБазВалюте;
				Движение.НаценкаВБазВалюте = РаботаСВалютой.Пересчитать2025(Движение.Наценка, Валюта, ВалютаДоллар, Фирма, Дата);
				// © Primus1C  ОКОНЧАНИЕ ◄
				Движение.Поставщик = Стр.Поставщик;
				//2016.04.07
				//Движение.ДокументПрихода = Стр.Партия.Док;
				Движение.ДокументПрихода = Стр.ДокументПартии;
				//2016.09.12
				Движение.Автор = КемСоздан;
				ЕстьПродажи = Истина;
			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;

	Если Окончательно Тогда
		
		//2015.11.21
		//появился регистр доходов
		
		//ВКД Кононов А.М. 05.02.20
		//локСумма = Сумма - СуммаЗакупки - СуммаУслуг;
		СуммаСЗатратами = 0;
		Для Каждого Стр Из Товары Цикл
			СуммаСЗатратами = СуммаСЗатратами + (Стр.Количество * Стр.ВКД_ЦенаСЗатратами);
		КонецЦикла;
		локСумма = Товары.Итог("СуммаПродажи") - СуммаСЗатратами - СуммаУслуг;
		//..
		
		// © Primus1C  04.12.2025  НАЧАЛО ►
		Запр = Новый Запрос;
		Запр.Текст = "ВЫБРАТЬ
		             |	СУММА(РНТовары.СуммаПродажи - РНТовары.Количество * РНТовары.ВКД_ЦенаСЗатратами) КАК СуммаСЗатратами,
		             |	РНТовары.Партия.Док.ВКД_Инвойс.ДокументОснование.СкладОтправитель.Статья КАК Статья
		             |ИЗ
		             |	Документ.РасходнаяНакладная.Товары КАК РНТовары
		             |ГДЕ
		             |	РНТовары.Ссылка = &Ссылка
		             |	И РНТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	РНТовары.Партия.Док.ВКД_Инвойс.ДокументОснование.СкладОтправитель.Статья";
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл  
			Если ЗначениеЗаполнено(Выборка.Статья) Тогда
				лСтатья = Выборка.Статья	
			Иначе
			    лСтатья = Справочники.Статьи.ДоходОтПродажи;
			КонецЕсли;
			//Сообщить(СтрШаблон("%1: %2", лСтатья, Выборка.СуммаСЗатратами)); 
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период 	= Дата;
			Движение.Фирма 		= Фирма;
			Движение.Вид 		= Перечисления.ДоходРасход.Доход;
			Движение.Статья 	= лСтатья;
			Движение.Валюта 	= Валюта;
			Движение.Сумма 		= Выборка.СуммаСЗатратами;
			ЕстьРасходыДоходы 	= Истина;
		КонецЦикла;
		
		// © Primus1C  ОКОНЧАНИЕ ◄
		
		//Если локСумма <> 0 Тогда
		//	Движение = Движения.РасходыДоходы.Добавить();
		//	Движение.Период = Дата;
		//	Движение.Фирма = Фирма;
		//	Движение.Вид = Перечисления.ДоходРасход.Доход;
		//	Движение.Статья = Справочники.Статьи.ДоходОтПродажи;
		//	Движение.Валюта = Валюта;
		//	//2016.05.24
		//	//исключаем услуги именно из доходов
		//	Движение.Сумма = локСумма;
		//	ЕстьРасходыДоходы = Истина;
		//КонецЕсли; 
		
		//2016.05.29
		//договорились, что проводим услуги отдельной статьей
		Если СуммаУслуг <> 0 Тогда  
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Вид = Перечисления.ДоходРасход.Доход;
			Движение.Статья = Справочники.Статьи.ДоходОтУслуг;
			Движение.Валюта = Валюта;
			Движение.Сумма = СуммаУслуг;
			ЕстьРасходыДоходы = Истина;
		КонецЕсли;
		
		Движение = Движения.Долги.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Док = Ссылка;
		Движение.Валюта = Валюта;
		Движение.Контрагент = Контрагент;
		Движение.ДолгПокупателя = Сумма;
		Движение.ПредоплатаПокупателя = 0;
		Движение.ДолгПоставщику = 0;
		Движение.ПредоплатаПоставщику = 0;
		Движение.Чем = 0;
		ЕстьДолги = Истина;
		
		Для Каждого Стр Из Привязки Цикл
			Движение = Движения.Долги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Док = Стр.Док2;
			Движение.Валюта = Стр.Валюта2;
			Движение.Контрагент = Контрагент;
			Движение.ДолгПокупателя = 0;
			Движение.ПредоплатаПокупателя = ?(Стр.ЭтоПредоплата, Стр.Сумма2, 0);
			Движение.ДолгПоставщику = ?(Стр.ЭтоПредоплата, 0, Стр.Сумма2);
			Движение.ПредоплатаПоставщику = 0;
			Движение.Чем = Ссылка;
			ЕстьДолги = Истина;
			
			Движение = Движения.Долги.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Док = Ссылка;
			Движение.Валюта = Валюта;
			Движение.Контрагент = Контрагент;
			Движение.ДолгПокупателя = Стр.Сумма1;
			Движение.ПредоплатаПокупателя = 0;
			Движение.ДолгПоставщику = 0;
			Движение.ПредоплатаПоставщику = 0;
			Движение.Чем = Стр.Док2;
			ЕстьДолги = Истина;
		КонецЦикла; 
		
		//2015.11.27
		//универсально, независимо от типа, проводим КР, если они есть
		Если СуммаКР <> 0 Тогда
			Движение = Движения.РасходыДоходы.Добавить();
			Движение.Период = Дата;
			Движение.Фирма = Фирма;
			Движение.Статья = ?(СуммаКР < 0, Справочники.Статьи.РасходОтКР, Справочники.Статьи.ДоходОтКР);
			//здесь вид после статьи
			Движение.Вид = Движение.Статья.ВидСтатьи;
			Движение.Валюта = Валюта;
			Движение.Сумма = гоАбс(СуммаКР);
			ЕстьРасходыДоходы = Истина;
		КонецЕсли; 
		
	Иначе // НЕ Окончательно
		
		Движение = Движения.НезакрытыеДокументы.ДобавитьПриход();
		Движение.Период = Дата;
		Движение.Фирма = Фирма;
		Движение.Контрагент = Контрагент;
		Движение.ВидДокумента = Перечисления.ВидДокумента.РасходнаяНакладная;
		Движение.Количество = 1;
		ЕстьНезакрытые = Истина; 
		
	КонецЕсли; 
	
	// © Primus1C  22.07.2026  НАЧАЛО ►
	
	// РН РезервыТовара  
	
	Движения.РезервыТовара.Записывать = Истина;
	
	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвойсПродажи") И ДокументОснование.РезервироватьТовар Тогда
	
		Запр = Новый Запрос;
		Запр.УстановитьПараметр("Ссылка", Ссылка);
		Запр.Текст = "ВЫБРАТЬ
		             |	ТЧТовары.Номенклатура КАК Номенклатура,
		             |	СУММА(ТЧТовары.Количество) КАК Количество
		             |ИЗ
		             |	Документ.РасходнаяНакладная.Товары КАК ТЧТовары
		             |ГДЕ
		             |	ТЧТовары.Ссылка = &Ссылка
		             |	И ТЧТовары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ТЧТовары.Номенклатура";
		Выборка = Запр.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Движения.РезервыТовара.Добавить();
			Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
			Движение.Период 		= Дата;
			Движение.Номенклатура 	= Выборка.Номенклатура;
			Движение.Заказ 			= ДокументОснование;   
			Движение.Склад          = Склад;
			Движение.Фирма          = Фирма;
			Движение.Количество 	= Выборка.Количество;
		КонецЦикла;
		
	КонецЕсли;
	
	// © Primus1C  ОКОНЧАНИЕ ◄

	Движения.Долги.Записывать = ЕстьДолги;
	Движения.ОстаткиТовара.Записывать = ЕстьОстатки;
	Движения.НезакрытыеДокументы.Записывать = ЕстьНезакрытые;
	Движения.РасходыДоходы.Записывать = ЕстьРасходыДоходы;
	//2015.12.08
	//Движения.РезервыТовара.Записывать = ЕстьРезервы;
	//2015.12.11
	Движения.Продажи.Записывать = ЕстьПродажи; 
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если гоАдминистратор() Тогда 
		УстановитьСтатус(Перечисления.СтатусыИнвойсаПродажи.ГотовКОтгрузке);
		Возврат; 
	КонецЕсли; 
	
	Если Окончательно Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ закрыт {Окончательно}!'; en = 'Unposted is not possible! The document is closed <Finally>!'")); Отказ = Истина; КонецЕсли;
	
	Если Товары.Количество() <> 0 Тогда Сообщить(НСтр("ru = 'Отмена проведения невозможна! Документ не пустой!'; en = 'Unposted is not possible! The document is not empty!'")); Отказ = Истина; КонецЕсли;
	
	//	Если НачалоДня(Дата) < гоТекущаяДата() Тогда
	//		Сообщить("Только Избранный!"); Отказ = Истина; Возврат; КонецЕсли;   

	УстановитьСтатус(Перечисления.СтатусыИнвойсаПродажи.ГотовКОтгрузке);
	
КонецПроцедуры

Процедура УстановитьСтатус(Статус)

	Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ИнвойсПродажи") Тогда                
		КемИзменено = Неопределено;
		РаботаСИнвойсами.ЗаписатьСтатусИнвойсаПродажи(ДокументОснование, Статус, Ссылка, КемИзменено);
	КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)   
	
	//// Затраты
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", Ссылка);
	//Запр.Текст = "ВЫБРАТЬ
	//			|	Затраты.Партия КАК Партия,
	//			|	СУММА(Затраты.Сумма) КАК Сумма
	//			|ИЗ
	//			|	РегистрСведений.Затраты КАК Затраты
	//			|ГДЕ
	//			|	Затраты.Партия В
	//			|			(ВЫБРАТЬ
	//			|				РНТовары.Партия
	//			|			ИЗ
	//			|				Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|			ГДЕ
	//			|				РНТовары.Ссылка = &Ссылка)
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	Затраты.Партия
	//			|;
	//			|
	//			|////////////////////////////////////////////////////////////////////////////////
	//			|ВЫБРАТЬ
	//			|	Свод.Партия КАК Партия,
	//			//|	Свод.Валюта КАК Валюта,
	//			|	СУММА(Свод.Сумма) КАК Сумма
	//			|ИЗ
	//			|	(ВЫБРАТЬ
	//			|		Партии.Ссылка КАК Партия,
	//			|		Партии.Владелец КАК Номенклатура,
	//			|		Партии.Док.ВКД_Инвойс КАК Инвойс,
	//			|		Партии.Док.Поставка КАК Поставка,
	//			//|		ЗатратыИнв.Валюта КАК Валюта,
	//			|		ЗатратыИнв.Сумма КАК Сумма
	//			|	ИЗ
	//			|		Справочник.Партии КАК Партии
	//			|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//			|				Затраты.Сумма КАК Сумма,
	//			//|				Затраты.Валюта КАК Валюта,
	//			|				Затраты.Номенклатура КАК Номенклатура,
	//			|				Затраты.Инвойс КАК Инвойс,
	//			|				Затраты.Поставка КАК Поставка
	//			|			ИЗ
	//			|				РегистрСведений.Затраты КАК Затраты
	//			|			ГДЕ
	//			|				(Затраты.Номенклатура, Затраты.Инвойс, Затраты.Поставка, Затраты.Партия) В
	//			|						(ВЫБРАТЬ
	//			|							П.Владелец,
	//			|							П.Док.ВКД_Инвойс,
	//			|							П.Док.Поставка,
	//			|							ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	//			|						ИЗ
	//			|							Справочник.Партии КАК П
	//			|						ГДЕ
	//			|							П.Ссылка В
	//			|								(ВЫБРАТЬ
	//			|									РНТовары.Партия
	//			|								ИЗ
	//			|									Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|								ГДЕ
	//			|									РНТовары.Ссылка = &Ссылка))) КАК ЗатратыИнв
	//			|			ПО Партии.Владелец = ЗатратыИнв.Номенклатура
	//			|				И Партии.Док.ВКД_Инвойс = ЗатратыИнв.Инвойс
	//			|				И Партии.Док.Поставка = ЗатратыИнв.Поставка
	//			|	ГДЕ
	//			|		Партии.Ссылка В
	//			|				(ВЫБРАТЬ
	//			|					РНТовары.Партия
	//			|				ИЗ
	//			|					Документ.РасходнаяНакладная.Товары КАК РНТовары
	//			|				ГДЕ
	//			|					РНТовары.Ссылка = &Ссылка)) КАК Свод
	//			|
	//			|СГРУППИРОВАТЬ ПО
	//			|	Свод.Партия
	//			//|	Свод.Валюта
	//			|";
	//Пакет = Запр.ВыполнитьПакет();
	//ВыборкаПартии = Пакет[0].Выбрать(); 
	//СоотвЗатратыПартии = Новый Соответствие;
	//Пока ВыборкаПартии.Следующий() Цикл
	//	СоотвЗатратыПартии.Вставить(ВыборкаПартии.Партия, ВыборкаПартии.Сумма);		
	//КонецЦикла;
	//ВыборкаПартииИнв = Пакет[1].Выбрать(); 
	//СоотвПартииИнв = Новый Соответствие;
	//Пока ВыборкаПартииИнв.Следующий() Цикл
	//	СоотвПартииИнв.Вставить(ВыборкаПартииИнв.Партия, ВыборкаПартииИнв.Сумма);		
	//КонецЦикла;

	//КоличествоВозвратов = 0;
	//Для Каждого Стр Из Товары Цикл 
	//	//+++
	//	Стр.ДатаВозврата = Дата(1,1,1);
	//	//---
	//	ПересчитатьСтроку(Стр, СоотвЗатратыПартии, СоотвПартииИнв);
	//	Если ЗначениеЗаполнено(Стр.ДатаВозврата) Тогда 
	//		гоПлюс(КоличествоВозвратов, Стр.Количество) 
	//	КонецЕсли; 
	//КонецЦикла; 

	//// ПроцентПлюс и ПроцентМинус 
	//
	//ПроцентПлюс = 0;
	//ПроцентМинус = 0;
	//Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Ссылка", Ссылка); 
	//
	//Запр.Текст = "ВЫБРАТЬ
	//             |	Товары.СуммаЗакупки КАК СуммаЗакупки,
	//             |	Товары.СуммаПродажи КАК СуммаПродажи,
	//             |	Товары.СуммаУслуг КАК СуммаУслуг,
	//             |	Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг КАК СуммаСЗатратами,
	//             |	ВЫБОР
	//             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг < Товары.СуммаПродажи
	//             |			ТОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг
	//             |		ИНАЧЕ 0
	//             |	КОНЕЦ КАК СуммаСЗатратамиПлюс,
	//             |	ВЫБОР
	//             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг > Товары.СуммаПродажи
	//             |			ТОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг
	//             |		ИНАЧЕ 0
	//             |	КОНЕЦ КАК СуммаСЗатратамиМинус,
	//             |	ВЫБОР
	//             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг < Товары.СуммаПродажи
	//             |			ТОГДА Товары.СуммаПродажи
	//             |		ИНАЧЕ 0
	//             |	КОНЕЦ КАК СуммаПродажиПлюс,
	//             |	ВЫБОР
	//             |		КОГДА Товары.ВКД_ЦенаСЗатратами * Товары.Количество - Товары.СуммаУслуг > Товары.СуммаПродажи
	//             |			ТОГДА Товары.СуммаПродажи
	//             |		ИНАЧЕ 0
	//             |	КОНЕЦ КАК СуммаПродажиМинус
	//             |ПОМЕСТИТЬ ВТ
	//             |ИЗ
	//             |	Документ.РасходнаяНакладная.Товары КАК Товары
	//             |ГДЕ
	//             |	Товары.Ссылка = &Ссылка
	//             |	И Товары.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	//             |;
	//             |
	//             |////////////////////////////////////////////////////////////////////////////////
	//             |ВЫБРАТЬ
	//             |	СУММА(ВТ.СуммаПродажи) КАК СуммаПродажи,
	//             |	ЕСТЬNULL(СУММА(ВТ.СуммаСЗатратамиПлюс), 0) КАК СуммаСЗатратамиПлюс,
	//             |	ЕСТЬNULL(СУММА(ВТ.СуммаСЗатратамиМинус), 0) КАК СуммаСЗатратамиМинус,
	//             |	ЕСТЬNULL(СУММА(ВТ.СуммаПродажиПлюс), 0) КАК СуммаПродажиПлюс,
	//             |	ЕСТЬNULL(СУММА(ВТ.СуммаПродажиМинус), 0) КАК СуммаПродажиМинус
	//             |ИЗ
	//             |	ВТ КАК ВТ";
	//Выборка = Запр.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда                 
	//	Если Выборка.СуммаСЗатратамиПлюс = 0 Тогда
	//		ПроцентПлюс = 0;	
	//	Иначе	
	//		ПроцентПлюс = (Выборка.СуммаПродажиПлюс - Выборка.СуммаСЗатратамиПлюс) / Выборка.СуммаСЗатратамиПлюс * 100;	
	//	КонецЕсли;
	//	Если Выборка.СуммаСЗатратамиМинус = 0 Тогда  
	//		ПроцентМинус = 0;
	//	Иначе	
	//		ПроцентМинус = (Выборка.СуммаПродажиМинус - Выборка.СуммаСЗатратамиМинус) / Выборка.СуммаСЗатратамиМинус * 100;	
	//	КонецЕсли;
	//КонецЕсли;

КонецПроцедуры
